// Дано натуральное число, выведите его последнюю цифру.

#include <iostream>
using namespace std;

int main() 
{
    int a, b;

    cout << "Введите натуральное число: ";
    cin >> a;

    b = a % 10;
    cout << x;
}