// Напишите программу, которая запрашивает четыре целых числа и выводит их в обратном порядке по одному в строке.

#include <iostream>
using namespace std;

int main()
{
    int a, b, c, d;

    cout << "Введите 1 число: ";
    cin >> a;

    cout << "Введите 2 число: ";
    cin >> b;

    cout << "Введите 3 число: ";
    cin >> c;

    cout << "Введите 4 число: ";
    cin >> d;

    cout << d << endl;
    cout << c << endl;
    cout << b << endl;
    cout << a << endl;
}