// Напишите программу, которая запрашивает три цифры (от 0 до 9) и выводит число, получающееся из этих цифр в том же порядке, что и при вводе.

#include <iostream>
using namespace std;

int main()
{
    int a, b, c;

    cout << "Введите 1 число: ";
    cin >> a;

    cout << "Введите 2 число: ";
    cin >> b;

    cout << "Введите 3 число: ";
    cin >> c;

    cout << a;
    cout << b;
    cout << c;
}