// 1) ввод с клавиатуры данных в массив SHOP, состоящий из 5 элементов типа TOVAR 
// 2) вывод на экран информации о товарах
// 3) стоимость которых больше введенного с клавиатуры значения 
// 4) если таких товаров нет, выдать на дисплей соответствующее сообщение
#include <iostream>
#include <iomanip>
#include <string.h>
using namespace std;

int main()
{
    const int a = 5;
    int Tovar1[Молоко 1 литр 3,2%];
    int Tovar2[хлеб поклеванный 300 грамм];
    int Tovar3[яблоки 500 грамм];
    int Tovar4[вода газированная Кувака 1 литр];
    int Tovar5[Сыр плавленый хохланд, сливочный, 400г];

}